99percentpeople/esp32qjs/components/esp32_mquickjs/internal/esp32_mquickjs_wifi.h
#pragma once

#include "esp32_mquickjs_types.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI

#include <stdint.h>
#include <stdatomic.h>

#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_wifi_action_lane.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_timer.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"

#define ESP32_MQUICKJS_WIFI_MAX_SCAN_RECORDS 32U
#define ESP32_MQUICKJS_WIFI_MAX_WATCHERS 4U
#define ESP32_MQUICKJS_WIFI_MAX_WATCH_CAPACITY 64U
#define ESP32_MQUICKJS_WIFI_WATCH_INGRESS_CAPACITY 32U
#define ESP32_MQUICKJS_WIFI_WATCH_NEIGHBOR_SLOTS 2U
#define ESP32_MQUICKJS_WIFI_WATCH_MAX_NEIGHBORS 64U
#define ESP32_MQUICKJS_WIFI_WATCH_MAX_REPORT_BYTES 4096U

JSValue js_wifi_watch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT || CONFIG_ESP_WIFI_11R_SUPPORT
JSValue js_wifi_roaming_watch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
#endif
JSValue esp32_mquickjs_wifi_watch_status(JSContext *ctx);
void esp32_mquickjs_wifi_watch_reset_counters(void);
void esp32_mquickjs_wifi_reset_connection_counters(void);
JSValue esp32_mquickjs_wifi_ap_status(JSContext *ctx);
void esp32_mquickjs_wifi_watch_capture(int32_t id, const void *data, uint32_t generation);
void esp32_mquickjs_deinit_wifi_watch_runtime(void);
bool esp32_mquickjs_wifi_watch_controlled(int32_t id);
bool esp32_mquickjs_wifi_watch_control_ready(int32_t id, uint32_t generation);
JSValue esp32_mquickjs_wifi_ssid_text(JSContext *ctx, const uint8_t *ssid, size_t length);
bool esp32_mquickjs_wifi_set_ssid_properties(JSContext *ctx, JSValue *object,
    const uint8_t *ssid, size_t length);
/* Pure capture/validation shared by connect and the upcoming configuration transaction. */
bool esp32_mquickjs_wifi_parse_connect_config(JSContext *ctx, int argc,
    JSGCRef *argv, wifi_config_t *config, uint32_t *timeout_ms);
bool esp32_mquickjs_wifi_parse_station_config(JSContext *ctx, int argc,
    JSGCRef *argv, wifi_config_t *config, uint32_t *timeout_ms);
bool esp32_mquickjs_wifi_parse_station_config_for_operation(JSContext *ctx, int argc,
    JSGCRef *argv, wifi_config_t *config, uint32_t *timeout_ms, const char *operation);
/* Native input capture for configure and public driver transactions.
 * Owns no driver/helper resources; caller must wipe successful output. */
bool esp32_mquickjs_wifi_parse_driver_config(JSContext *ctx, JSValue options,
    wifi_interface_t interface, wifi_config_t *config);
bool esp32_mquickjs_wifi_parse_driver_config_for_operation(JSContext *ctx, JSValue options,
    wifi_interface_t interface, wifi_config_t *config, const char *operation);
JSValue js_wifi_driver_restore(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
JSValue js_wifi_driver_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
JSValue js_wifi_driver_capabilities(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
JSValue js_wifi_driver_get_interface_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
JSValue js_wifi_driver_set_interface_config(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
/* Complete bounded outer capture; still internal until the public binding and
 * result/error contract are wired. Omitted lifecycle
 * selections remain explicit presence bits, never inferred by this parser.
 * Caller allocates this storage and securely wipes it after use. */
typedef struct {
    bool mode_set, storage_set, start_set;
    wifi_mode_t mode;
    wifi_storage_t storage;
    bool start, allow_disconnect;
    bool station_set, access_point_set;
    wifi_config_t station, access_point;
    esp32_mquickjs_wifi_radio_config_controls_t controls;
    esp32_mquickjs_wifi_radio_start_controls_t start_controls;
} esp32_mquickjs_wifi_configuration_t;
bool esp32_mquickjs_wifi_capture_stop_ap_timeout(JSContext *ctx, JSValue value, uint32_t *timeout_ms);
bool esp32_mquickjs_wifi_capture_disconnect(JSContext *ctx, JSValue options, uint32_t *timeout_ms);
bool esp32_mquickjs_wifi_capture_stop(JSContext *ctx, JSValue options, uint32_t *timeout_ms);
bool esp32_mquickjs_wifi_capture_restart(JSContext *ctx, JSValue options, uint32_t *timeout_ms, bool *allow_ap_restart);
JSValue js_wifi_driver_restart(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
bool esp32_mquickjs_wifi_capture_start(JSContext *ctx, JSValue options,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection);
esp_err_t esp32_mquickjs_wifi_ap_begin_start_configuration(
    esp32_mquickjs_wifi_radio_lease_t *application,
    const esp32_mquickjs_wifi_radio_lease_t *station,
    esp32_mquickjs_wifi_radio_configuration_selection_t *selection,
    esp32_mquickjs_wifi_radio_lifecycle_t *token, bool *already_started);
bool esp32_mquickjs_wifi_capture_configuration(JSContext *ctx, JSValue options,
    esp32_mquickjs_wifi_configuration_t *configuration);
/* Per-call progress, without credentials or pointers into caller storage. */
typedef struct {
    const char *stage;
    bool admitted, stop_attempted, configuration_attempted, resume_attempted;
} esp32_mquickjs_wifi_configuration_execution_t;
JSValue esp32_mquickjs_wifi_throw_configuration_error(JSContext *ctx, esp_err_t error,
    const char *option, const esp32_mquickjs_wifi_configuration_execution_t *execution);
JSValue js_wifi_configure(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv);
/* Internal captured-input executor. Caller wipes the entire capture on every
 * exit; resolved selections are returned only after the full transaction. */
esp_err_t esp32_mquickjs_wifi_apply_configuration(
    esp32_mquickjs_wifi_configuration_t *configuration,
    esp32_mquickjs_wifi_configuration_execution_t *execution);
esp_err_t esp32_mquickjs_wifi_activate_ap(wifi_config_t *config);
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
bool esp32_mquickjs_wifi_parse_start_ap_config(JSContext *ctx, JSValue input,
    wifi_config_t *config, bool *allow_disconnect);
bool esp32_mquickjs_wifi_parse_ap_config(JSContext *ctx, JSValue options,
    wifi_config_t *config, bool *allow_disconnect);
bool esp32_mquickjs_wifi_parse_ap_config_for_operation(JSContext *ctx, JSValue options,
    wifi_config_t *config, const char *operation);
#endif

